%约瑟夫森结的跳变电流分布,为了便于观察峰的位置，对一些数据进行约化
clc,clear
IB=[];
ic=36*10^(-6);
c=5.8*10^(-3);
r=10^(5);
phi0=2*10^(-15);
wp0=(2*2.7182818*ic*2*pi/(4.1356676969*10^(-15)*c))^(0.5);
gamma=2*1.380649 *10^(-3)*80*10^(-3)/r
n=2000;
t=0:10^(-12):10^(-9);
fdc=@(x)x*10^(-12);                  %随时间线性增大的直流偏置
fn=@(x)0.3*randn(1,length(x));       %符合高斯分布的热噪声
fmw=@(x)0.25*ic*sin(10*wp0*x);      %选择微波辐照
for i=1:1:n
ib=fdc(i)+fn(i)+fmw(i);     %电流ib
f=@(x)phi0*(-ic*cos(x)-ib*x)/(2*3.1416);      %搓衣板势 U-phi曲线 
xmin=fminbnd(f,-1,2);                         %根据一些特值的解析结果，取此阈值,求极小值
ymin=f(xmin);
tspan = 0:10^(-12):1*10^(-9);                 %时间区间
p0 = [ymin 0];                                %取势能低点为初值，导数为零
[t,p] = ode45(@(t,p) aaa(t,p,ib), tspan, p0); %解常微分方程，调用自定义函数aaa
phi=p(:,1);                                   %取phi随时间变化的值
f1=@(x)phi0*(ic*cos(x)+ib*x)/(2*3.1416);  
xmax=fminbnd(f1,2,4);                         %寻找势能在区间内极大值点
ymax=f(xmax);
if phi>ymax                                   %可以发生跳变的ib
   ib;
   IB=[IB,-ib]
end
end


